GopalSaraf/Practicals/PSDL/include/proc/pic16f18346.inc
// Register: FSR1H
#define FSR1H FSR1H
FSR1H                                    equ 0007h
// bitfield definitions
FSR1H_FSR1H_POSN                         equ 0000h
FSR1H_FSR1H_POSITION                     equ 0000h
FSR1H_FSR1H_SIZE                         equ 0008h
FSR1H_FSR1H_LENGTH                       equ 0008h
FSR1H_FSR1H_MASK                         equ 00FFh

// Register: BSR
#define BSR BSR
BSR                                      equ 0008h
// bitfield definitions
BSR_BSR_POSN                             equ 0000h
BSR_BSR_POSITION                         equ 0000h
BSR_BSR_SIZE                             equ 0005h
BSR_BSR_LENGTH                           equ 0005h
BSR_BSR_MASK                             equ 001Fh
BSR_BSR0_POSN                            equ 0000h
BSR_BSR0_POSITION                        equ 0000h
BSR_BSR0_SIZE                            equ 0001h
BSR_BSR0_LENGTH                          equ 0001h
BSR_BSR0_MASK                            equ 0001h
BSR_BSR1_POSN                            equ 0001h
BSR_BSR1_POSITION                        equ 0001h
BSR_BSR1_SIZE                            equ 0001h
BSR_BSR1_LENGTH                          equ 0001h
BSR_BSR1_MASK                            equ 0002h
BSR_BSR2_POSN                            equ 0002h
BSR_BSR2_POSITION                        equ 0002h
BSR_BSR2_SIZE                            equ 0001h
BSR_BSR2_LENGTH                          equ 0001h
BSR_BSR2_MASK                            equ 0004h
BSR_BSR3_POSN                            equ 0003h
BSR_BSR3_POSITION                        equ 0003h
BSR_BSR3_SIZE                            equ 0001h
BSR_BSR3_LENGTH                          equ 0001h
BSR_BSR3_MASK                            equ 0008h
BSR_BSR4_POSN                            equ 0004h
BSR_BSR4_POSITION                        equ 0004h
BSR_BSR4_SIZE                            equ 0001h
BSR_BSR4_LENGTH                          equ 0001h
BSR_BSR4_MASK                            equ 0010h

// Register: WREG
#define WREG WREG
WREG                                     equ 0009h
// bitfield definitions
WREG_WREG0_POSN                          equ 0000h
WREG_WREG0_POSITION                      equ 0000h
WREG_WREG0_SIZE                          equ 0008h
WREG_WREG0_LENGTH                        equ 0008h
WREG_WREG0_MASK                          equ 00FFh

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 000Ah
// bitfield definitions
PCLATH_PCLATH_POSN                       equ 0000h
PCLATH_PCLATH_POSITION                   equ 0000h
PCLATH_PCLATH_SIZE                       equ 0007h
PCLATH_PCLATH_LENGTH                     equ 0007h
PCLATH_PCLATH_MASK                       equ 007Fh

// Register: INTCON
#define INTCON INTCON
INTCON                                   equ 000Bh
// bitfield definitions
INTCON_INTEDG_POSN                       equ 0000h
INTCON_INTEDG_POSITION                   equ 0000h
INTCON_INTEDG_SIZE                       equ 0001h
INTCON_INTEDG_LENGTH                     equ 0001h
INTCON_INTEDG_MASK                       equ 0001h
INTCON_PEIE_POSN                         equ 0006h
INTCON_PEIE_POSITION                     equ 0006h
INTCON_PEIE_SIZE                         equ 0001h
INTCON_PEIE_LENGTH                       equ 0001h
INTCON_PEIE_MASK                         equ 0040h
INTCON_GIE_POSN                          equ 0007h
INTCON_GIE_POSITION                      equ 0007h
INTCON_GIE_SIZE                          equ 0001h
INTCON_GIE_LENGTH                        equ 0001h
INTCON_GIE_MASK                          equ 0080h

// Register: PORTA
#define PORTA PORTA
PORTA                                    equ 000Ch
// bitfield definitions
PORTA_RA0_POSN                           equ 0000h
PORTA_RA0_POSITION                       equ 0000h
PORTA_RA0_SIZE                           equ 0001h
PORTA_RA0_LENGTH                         equ 0001h
PORTA_RA0_MASK                           equ 0001h
PORTA_RA1_POSN                           equ 0001h
PORTA_RA1_POSITION                       equ 0001h
PORTA_RA1_SIZE                           equ 0001h
PORTA_RA1_LENGTH                         equ 0001h
PORTA_RA1_MASK                           equ 0002h
PORTA_RA2_POSN                           equ 0002h
PORTA_RA2_POSITION                       equ 0002h
PORTA_RA2_SIZE                           equ 0001h
PORTA_RA2_LENGTH                         equ 0001h
PORTA_RA2_MASK                           equ 0004h
PORTA_RA3_POSN                           equ 0003h
PORTA_RA3_POSITION                       equ 0003h
PORTA_RA3_SIZE                           equ 0001h
PORTA_RA3_LENGTH                         equ 0001h
PORTA_RA3_MASK                           equ 0008h
PORTA_RA4_POSN                           equ 0004h
PORTA_RA4_POSITION                       equ 0004h
PORTA_RA4_SIZE                           equ 0001h
PORTA_RA4_LENGTH                         equ 0001h
PORTA_RA4_MASK                           equ 0010h
PORTA_RA5_POSN                           equ 0005h
PORTA_RA5_POSITION                       equ 0005h
PORTA_RA5_SIZE                           equ 0001h
PORTA_RA5_LENGTH                         equ 0001h
PORTA_RA5_MASK                           equ 0020h

// Register: PORTB
#define PORTB PORTB
PORTB                                    equ 000Dh
// bitfield definitions
PORTB_RB4_POSN                           equ 0004h
PORTB_RB4_POSITION                       equ 0004h
PORTB_RB4_SIZE                           equ 0001h
PORTB_RB4_LENGTH                         equ 0001h
PORTB_RB4_MASK                           equ 0010h
PORTB_RB5_POSN                           equ 0005h
PORTB_RB5_POSITION                       equ 0005h
PORTB_RB5_SIZE                           equ 0001h
PORTB_RB5_LENGTH                         equ 0001h
PORTB_RB5_MASK                           equ 0020h
PORTB_RB6_POSN                           equ 0006h
PORTB_RB6_POSITION                       equ 0006h
PORTB_RB6_SIZE                           equ 0001h
PORTB_RB6_LENGTH                         equ 0001h
PORTB_RB6_MASK                           equ 0040h
PORTB_RB7_POSN                           equ 0007h
PORTB_RB7_POSITION                       equ 0007h
PORTB_RB7_SIZE                           equ 0001h
PORTB_RB7_LENGTH                         equ 0001h
PORTB_RB7_MASK                           equ 0080h

// Register: PORTC
#define PORTC PORTC
PORTC                                    equ 000Eh
// bitfield definitions
PORTC_RC0_POSN                           equ 0000h
PORTC_RC0_POSITION                       equ 0000h
PORTC_RC0_SIZE                           equ 0001h
PORTC_RC0_LENGTH                         equ 0001h
PORTC_RC0_MASK                           equ 0001h
PORTC_RC1_POSN                           equ 0001h
PORTC_RC1_POSITION                       equ 0001h
PORTC_RC1_SIZE                           equ 0001h
PORTC_RC1_LENGTH                         equ 0001h
PORTC_RC1_MASK                           equ 0002h
PORTC_RC2_POSN                           equ 0002h
PORTC_RC2_POSITION                       equ 0002h
PORTC_RC2_SIZE                           equ 0001h
PORTC_RC2_LENGTH                         equ 0001h
PORTC_RC2_MASK                           equ 0004h
PORTC_RC3_POSN                           equ 0003h
PORTC_RC3_POSITION                       equ 0003h
PORTC_RC3_SIZE                           equ 0001h
PORTC_RC3_LENGTH                         equ 0001h
PORTC_RC3_MASK                           equ 0008h
PORTC_RC4_POSN                           equ 0004h
PORTC_RC4_POSITION                       equ 0004h
PORTC_RC4_SIZE                           equ 0001h
PORTC_RC4_LENGTH                         equ 0001h
PORTC_RC4_MASK                           equ 0010h
PORTC_RC5_POSN                           equ 0005h
PORTC_RC5_POSITION                       equ 0005h
PORTC_RC5_SIZE                           equ 0001h
PORTC_RC5_LENGTH                         equ 0001h
PORTC_RC5_MASK                           equ 0020h
PORTC_RC6_POSN                           equ 0006h
PORTC_RC6_POSITION                       equ 0006h
PORTC_RC6_SIZE                           equ 0001h
PORTC_RC6_LENGTH                         equ 0001h
PORTC_RC6_MASK                           equ 0040h
PORTC_RC7_POSN                           equ 0007h
PORTC_RC7_POSITION                       equ 0007h
PORTC_RC7_SIZE                           equ 0001h
PORTC_RC7_LENGTH                         equ 0001h
PORTC_RC7_MASK                           equ 0080h

// Register: PIR0
#define PIR0 PIR0
PIR0                                     equ 0010h
// bitfield definitions
PIR0_INTF_POSN                           equ 0000h
PIR0_INTF_POSITION                       equ 0000h
PIR0_INTF_SIZE                           equ 0001h
PIR0_INTF_LENGTH                         equ 0001h
PIR0_INTF_MASK                           equ 0001h
PIR0_IOCIF_POSN                          equ 0004h
PIR0_IOCIF_POSITION                      equ 0004h
PIR0_IOCIF_SIZE                          equ 0001h
PIR0_IOCIF_LENGTH                        equ 0001h
PIR0_IOCIF_MASK                          equ 0010h
PIR0_TMR0IF_POSN                         equ 0005h
PIR0_TMR0IF_POSITION                     equ 0005h
PIR0_TMR0IF_SIZE                         equ 0001h
PIR0_TMR0IF_LENGTH                       equ 0001h
PIR0_TMR0IF_MASK                         equ 0020h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 0011h
// bitfield definitions
PIR1_TMR1IF_POSN                         equ 0000h
PIR1_TMR1IF_POSITION                     equ 0000h
PIR1_TMR1IF_SIZE                         equ 0001h
PIR1_TMR1IF_LENGTH                       equ 0001h
PIR1_TMR1IF_MASK                         equ 0001h
PIR1_TMR2IF_POSN                         equ 0001h
PIR1_TMR2IF_POSITION                     equ 0001h
PIR1_TMR2IF_SIZE                         equ 0001h
PIR1_TMR2IF_LENGTH                       equ 0001h
PIR1_TMR2IF_MASK                         equ 0002h
PIR1_BCL1IF_POSN                         equ 0002h
PIR1_BCL1IF_POSITION                     equ 0002h
PIR1_BCL1IF_SIZE                         equ 0001h
PIR1_BCL1IF_LENGTH                       equ 0001h
PIR1_BCL1IF_MASK                         equ 0004h
PIR1_SSP1IF_POSN                         equ 0003h
PIR1_SSP1IF_POSITION                     equ 0003h
PIR1_SSP1IF_SIZE                         equ 0001h
PIR1_SSP1IF_LENGTH                       equ 0001h
PIR1_SSP1IF_MASK                         equ 0008h
PIR1_TXIF_POSN                           equ 0004h
PIR1_TXIF_POSITION                       equ 0004h
PIR1_TXIF_SIZE                           equ 0001h
PIR1_TXIF_LENGTH                         equ 0001h
PIR1_TXIF_MASK                           equ 0010h
PIR1_RCIF_POSN                           equ 0005h
PIR1_RCIF_POSITION                       equ 0005h
PIR1_RCIF_SIZE                           equ 0001h
PIR1_RCIF_LENGTH                         equ 0001h
PIR1_RCIF_MASK                           equ 0020h
PIR1_ADIF_POSN                           equ 0006h
PIR1_ADIF_POSITION                       equ 0006h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0040h
PIR1_TMR1GIF_POSN                        equ 0007h
PIR1_TMR1GIF_POSITION                    equ 0007h
PIR1_TMR1GIF_SIZE                        equ 0001h
PIR1_TMR1GIF_LENGTH                      equ 0001h
PIR1_TMR1GIF_MASK                        equ 0080h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 0012h
// bitfield definitions
PIR2_NCO1IF_POSN                         equ 0000h
PIR2_NCO1IF_POSITION                     equ 0000h
PIR2_NCO1IF_SIZE                         equ 0001h
PIR2_NCO1IF_LENGTH                       equ 0001h
PIR2_NCO1IF_MASK                         equ 0001h
PIR2_TMR4IF_POSN                         equ 0001h
PIR2_TMR4IF_POSITION                     equ 0001h
PIR2_TMR4IF_SIZE                         equ 0001h
PIR2_TMR4IF_LENGTH                       equ 0001h
PIR2_TMR4IF_MASK                         equ 0002h
PIR2_BCL2IF_POSN                         equ 0002h
PIR2_BCL2IF_POSITION                     equ 0002h
PIR2_BCL2IF_SIZE                         equ 0001h
PIR2_BCL2IF_LENGTH                       equ 0001h
PIR2_BCL2IF_MASK                         equ 0004h
PIR2_SSP2IF_POSN                         equ 0003h
PIR2_SSP2IF_POSITION                     equ 0003h
PIR2_SSP2IF_SIZE                         equ 0001h
PIR2_SSP2IF_LENGTH                       equ 0001h
PIR2_SSP2IF_MASK                         equ 0008h
PIR2_NVMIF_POSN                          equ 0004h
PIR2_NVMIF_POSITION                      equ 0004h
PIR2_NVMIF_SIZE                          equ 0001h
PIR2_NVMIF_LENGTH                        equ 0001h
PIR2_NVMIF_MASK                          equ 0010h
PIR2_C1IF_POSN                           equ 0005h
PIR2_C1IF_POSITION                       equ 0005h
PIR2_C1IF_SIZE                           equ 0001h
PIR2_C1IF_LENGTH                         equ 0001h
PIR2_C1IF_MASK                           equ 0020h
PIR2_C2IF_POSN                           equ 0006h
PIR2_C2IF_POSITION                       equ 0006h
PIR2_C2IF_SIZE                           equ 0001h
PIR2_C2IF_LENGTH                         equ 0001h
PIR2_C2IF_MASK                           equ 0040h
PIR2_TMR6IF_POSN                         equ 0007h
PIR2_TMR6IF_POSITION                     equ 0007h
PIR2_TMR6IF_SIZE                         equ 0001h
PIR2_TMR6IF_LENGTH                       equ 0001h
PIR2_TMR6IF_MASK                         equ 0080h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 0013h
// bitfield definitions
PIR3_CLC1IF_POSN                         equ 0000h
PIR3_CLC1IF_POSITION                     equ 0000h
PIR3_CLC1IF_SIZE                         equ 0001h
PIR3_CLC1IF_LENGTH                       equ 0001h
PIR3_CLC1IF_MASK                         equ 0001h
PIR3_CLC2IF_POSN                         equ 0001h
PIR3_CLC2IF_POSITION                     equ 0001h
PIR3_CLC2IF_SIZE                         equ 0001h
PIR3_CLC2IF_LENGTH                       equ 0001h
PIR3_CLC2IF_MASK                         equ 0002h
PIR3_CLC3IF_POSN                         equ 0002h
PIR3_CLC3IF_POSITION                     equ 0002h
PIR3_CLC3IF_SIZE                         equ 0001h
PIR3_CLC3IF_LENGTH                       equ 0001h
PIR3_CLC3IF_MASK                         equ 0004h
PIR3_CLC4IF_POSN                         equ 0003h
PIR3_CLC4IF_POSITION                     equ 0003h
PIR3_CLC4IF_SIZE                         equ 0001h
PIR3_CLC4IF_LENGTH                       equ 0001h
PIR3_CLC4IF_MASK                         equ 0008h
PIR3_TMR3IF_POSN                         equ 0004h
PIR3_TMR3IF_POSITION                     equ 0004h
PIR3_TMR3IF_SIZE                         equ 0001h
PIR3_TMR3IF_LENGTH                       equ 0001h
PIR3_TMR3IF_MASK                         equ 0010h
PIR3_TMR3GIF_POSN                        equ 0005h
PIR3_TMR3GIF_POSITION                    equ 0005h
PIR3_TMR3GIF_SIZE                        equ 0001h
PIR3_TMR3GIF_LENGTH                      equ 0001h
PIR3_TMR3GIF_MASK                        equ 0020h
PIR3_CSWIF_POSN                          equ 0006h
PIR3_CSWIF_POSITION                      equ 0006h
PIR3_CSWIF_SIZE                          equ 0001h
PIR3_CSWIF_LENGTH                        equ 0001h
PIR3_CSWIF_MASK                          equ 0040h
PIR3_OSFIF_POSN                          equ 0007h
PIR3_OSFIF_POSITION                      equ 0007h
PIR3_OSFIF_SIZE                          equ 0001h
PIR3_OSFIF_LENGTH                        equ 0001h
PIR3_OSFIF_MASK                          equ 0080h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 0014h
// bitfield definitions
PIR4_CCP1IF_POSN                         equ 0000h
PIR4_CCP1IF_POSITION                     equ 0000h
PIR4_CCP1IF_SIZE                         equ 0001h
PIR4_CCP1IF_LENGTH                       equ 0001h
PIR4_CCP1IF_MASK                         equ 0001h
PIR4_CCP2IF_POSN                         equ 0001h
PIR4_CCP2IF_POSITION                     equ 0001h
PIR4_CCP2IF_SIZE                         equ 0001h
PIR4_CCP2IF_LENGTH                       equ 0001h
PIR4_CCP2IF_MASK                         equ 0002h
PIR4_CCP3IF_POSN                         equ 0002h
PIR4_CCP3IF_POSITION                     equ 0002h
PIR4_CCP3IF_SIZE                         equ 0001h
PIR4_CCP3IF_LENGTH                       equ 0001h
PIR4_CCP3IF_MASK                         equ 0004h
PIR4_CCP4IF_POSN                         equ 0003h
PIR4_CCP4IF_POSITION                     equ 0003h
PIR4_CCP4IF_SIZE                         equ 0001h
PIR4_CCP4IF_LENGTH                       equ 0001h
PIR4_CCP4IF_MASK                         equ 0008h
PIR4_TMR5IF_POSN                         equ 0004h
PIR4_TMR5IF_POSITION                     equ 0004h
PIR4_TMR5IF_SIZE                         equ 0001h
PIR4_TMR5IF_LENGTH                       equ 0001h
PIR4_TMR5IF_MASK                         equ 0010h
PIR4_TMR5GIF_POSN                        equ 0005h
PIR4_TMR5GIF_POSITION                    equ 0005h
PIR4_TMR5GIF_SIZE                        equ 0001h
PIR4_TMR5GIF_LENGTH                      equ 0001h
PIR4_TMR5GIF_MASK                        equ 0020h
PIR4_CWG1IF_POSN                         equ 0006h
PIR4_CWG1IF_POSITION                     equ 0006h
PIR4_CWG1IF_SIZE                         equ 0001h
PIR4_CWG1IF_LENGTH                       equ 0001h
PIR4_CWG1IF_MASK                         equ 0040h
PIR4_CWG2IF_POSN                         equ 0007h
PIR4_CWG2IF_POSITION                     equ 0007h
PIR4_CWG2IF_SIZE                         equ 0001h
PIR4_CWG2IF_LENGTH                       equ 0001h
PIR4_CWG2IF_MASK                         equ 0080h

// Register: TMR0L
#define TMR0L TMR0L
TMR0L                                    equ 0015h
// bitfield definitions
TMR0L_TMR0L_POSN                         equ 0000h
TMR0L_TMR0L_POSITION                     equ 0000h
TMR0L_TMR0L_SIZE                         equ 0008h
TMR0L_TMR0L_LENGTH                       equ 0008h
TMR0L_TMR0L_MASK                         equ 00FFh
TMR0L_TMR00_POSN                         equ 0000h
TMR0L_TMR00_POSITION                     equ 0000h
TMR0L_TMR00_SIZE                         equ 0001h
TMR0L_TMR00_LENGTH                       equ 0001h
TMR0L_TMR00_MASK                         equ 0001h
TMR0L_TMR01_POSN                         equ 0001h
TMR0L_TMR01_POSITION                     equ 0001h
TMR0L_TMR01_SIZE                         equ 0001h
TMR0L_TMR01_LENGTH                       equ 0001h
TMR0L_TMR01_MASK                         equ 0002h
TMR0L_TMR02_POSN                         equ 0002h
TMR0L_TMR02_POSITION                     equ 0002h
TMR0L_TMR02_SIZE                         equ 0001h
TMR0L_TMR02_LENGTH                       equ 0001h
TMR0L_TMR02_MASK                         equ 0004h
TMR0L_TMR03_POSN                         equ 0003h
TMR0L_TMR03_POSITION                     equ 0003h
TMR0L_TMR03_SIZE                         equ 0001h
TMR0L_TMR03_LENGTH                       equ 0001h
TMR0L_TMR03_MASK                         equ 0008h
TMR0L_TMR04_POSN                         equ 0004h
TMR0L_TMR04_POSITION                     equ 0004h
TMR0L_TMR04_SIZE                         equ 0001h
TMR0L_TMR04_LENGTH                       equ 0001h
TMR0L_TMR04_MASK                         equ 0010h
TMR0L_TMR05_POSN                         equ 0005h
TMR0L_TMR05_POSITION                     equ 0005h
TMR0L_TMR05_SIZE                         equ 0001h
TMR0L_TMR05_LENGTH                       equ 0001h
TMR0L_TMR05_MASK                         equ 0020h
TMR0L_TMR06_POSN                         equ 0006h
TMR0L_TMR06_POSITION                     equ 0006h
TMR0L_TMR06_SIZE                         equ 0001h
TMR0L_TMR06_LENGTH                       equ 0001h
TMR0L_TMR06_MASK                         equ 0040h
TMR0L_TMR07_POSN                         equ 0007h
TMR0L_TMR07_POSITION                     equ 0007h
TMR0L_TMR07_SIZE                         equ 0001h
TMR0L_TMR07_LENGTH                       equ 0001h
TMR0L_TMR07_MASK                         equ 0080h

// Register: TMR0H
#define TMR0H TMR0H
TMR0H                                    equ 0016h
// bitfield definitions
TMR0H_TMR0H_POSN                         equ 0000h
TMR0H_TMR0H_POSITION                     equ 0000h
TMR0H_TMR0H_SIZE                         equ 0008h
TMR0H_TMR0H_LENGTH                       equ 0008h
TMR0H_TMR0H_MASK                         equ 00FFh
TMR0H_TMR08_POSN                         equ 0000h
TMR0H_TMR08_POSITION                     equ 0000h
TMR0H_TMR08_SIZE                         equ 0001h
TMR0H_TMR08_LENGTH                       equ 0001h
TMR0H_TMR08_MASK                         equ 0001h
TMR0H_TMR09_POSN                         equ 0001h
TMR0H_TMR09_POSITION                     equ 0001h
TMR0H_TMR09_SIZE                         equ 0001h
TMR0H_TMR09_LENGTH                       equ 0001h
TMR0H_TMR09_MASK                         equ 0002h
TMR0H_TMR010_POSN                        equ 0002h
TMR0H_TMR010_POSITION                    equ 0002h
TMR0H_TMR010_SIZE                        equ 0001h
TMR0H_TMR010_LENGTH                      equ 0001h
TMR0H_TMR010_MASK                        equ 0004h
TMR0H_TMR011_POSN                        equ 0003h
TMR0H_TMR011_POSITION                    equ 0003h
TMR0H_TMR011_SIZE                        equ 0001h
TMR0H_TMR011_LENGTH                      equ 0001h
TMR0H_TMR011_MASK                        equ 0008h
TMR0H_TMR012_POSN                        equ 0004h
TMR0H_TMR012_POSITION                    equ 0004h
TMR0H_TMR012_SIZE                        equ 0001h
TMR0H_TMR012_LENGTH                      equ 0001h
TMR0H_TMR012_MASK                        equ 0010h
TMR0H_TMR013_POSN                        equ 0005h
TMR0H_TMR013_POSITION                    equ 0005h
TMR0H_TMR013_SIZE                        equ 0001h
TMR0H_TMR013_LENGTH                      equ 0001h
TMR0H_TMR013_MASK                        equ 0020h
TMR0H_TMR014_POSN                        equ 0006h
TMR0H_TMR014_POSITION                    equ 0006h
TMR0H_TMR014_SIZE                        equ 0001h
TMR0H_TMR014_LENGTH                      equ 0001h
TMR0H_TMR014_MASK                        equ 0040h
TMR0H_TMR015_POSN                        equ 0007h
TMR0H_TMR015_POSITION                    equ 0007h
TMR0H_TMR015_SIZE                        equ 0001h
TMR0H_TMR015_LENGTH                      equ 0001h
TMR0H_TMR015_MASK                        equ 0080h
TMR0H_PR0_POSN                           equ 0000h
TMR0H_PR0_POSITION                       equ 0000h
TMR0H_PR0_SIZE                           equ 0008h
TMR0H_PR0_LENGTH                         equ 0008h
TMR0H_PR0_MASK                           equ 00FFh

