GopalSaraf/Practicals/PSDL/include/proc/pic16f18346.inc
// Register: SSP1CON3
#define SSP1CON3 SSP1CON3
SSP1CON3                                 equ 0217h
// bitfield definitions
SSP1CON3_DHEN_POSN                       equ 0000h
SSP1CON3_DHEN_POSITION                   equ 0000h
SSP1CON3_DHEN_SIZE                       equ 0001h
SSP1CON3_DHEN_LENGTH                     equ 0001h
SSP1CON3_DHEN_MASK                       equ 0001h
SSP1CON3_AHEN_POSN                       equ 0001h
SSP1CON3_AHEN_POSITION                   equ 0001h
SSP1CON3_AHEN_SIZE                       equ 0001h
SSP1CON3_AHEN_LENGTH                     equ 0001h
SSP1CON3_AHEN_MASK                       equ 0002h
SSP1CON3_SBCDE_POSN                      equ 0002h
SSP1CON3_SBCDE_POSITION                  equ 0002h
SSP1CON3_SBCDE_SIZE                      equ 0001h
SSP1CON3_SBCDE_LENGTH                    equ 0001h
SSP1CON3_SBCDE_MASK                      equ 0004h
SSP1CON3_SDAHT_POSN                      equ 0003h
SSP1CON3_SDAHT_POSITION                  equ 0003h
SSP1CON3_SDAHT_SIZE                      equ 0001h
SSP1CON3_SDAHT_LENGTH                    equ 0001h
SSP1CON3_SDAHT_MASK                      equ 0008h
SSP1CON3_BOEN_POSN                       equ 0004h
SSP1CON3_BOEN_POSITION                   equ 0004h
SSP1CON3_BOEN_SIZE                       equ 0001h
SSP1CON3_BOEN_LENGTH                     equ 0001h
SSP1CON3_BOEN_MASK                       equ 0010h
SSP1CON3_SCIE_POSN                       equ 0005h
SSP1CON3_SCIE_POSITION                   equ 0005h
SSP1CON3_SCIE_SIZE                       equ 0001h
SSP1CON3_SCIE_LENGTH                     equ 0001h
SSP1CON3_SCIE_MASK                       equ 0020h
SSP1CON3_PCIE_POSN                       equ 0006h
SSP1CON3_PCIE_POSITION                   equ 0006h
SSP1CON3_PCIE_SIZE                       equ 0001h
SSP1CON3_PCIE_LENGTH                     equ 0001h
SSP1CON3_PCIE_MASK                       equ 0040h
SSP1CON3_ACKTIM_POSN                     equ 0007h
SSP1CON3_ACKTIM_POSITION                 equ 0007h
SSP1CON3_ACKTIM_SIZE                     equ 0001h
SSP1CON3_ACKTIM_LENGTH                   equ 0001h
SSP1CON3_ACKTIM_MASK                     equ 0080h

// Register: SSP2BUF
#define SSP2BUF SSP2BUF
SSP2BUF                                  equ 0219h
// bitfield definitions
SSP2BUF_SSP2BUF0_POSN                    equ 0000h
SSP2BUF_SSP2BUF0_POSITION                equ 0000h
SSP2BUF_SSP2BUF0_SIZE                    equ 0001h
SSP2BUF_SSP2BUF0_LENGTH                  equ 0001h
SSP2BUF_SSP2BUF0_MASK                    equ 0001h
SSP2BUF_SSP2BUF1_POSN                    equ 0001h
SSP2BUF_SSP2BUF1_POSITION                equ 0001h
SSP2BUF_SSP2BUF1_SIZE                    equ 0001h
SSP2BUF_SSP2BUF1_LENGTH                  equ 0001h
SSP2BUF_SSP2BUF1_MASK                    equ 0002h
SSP2BUF_SSP2BUF2_POSN                    equ 0002h
SSP2BUF_SSP2BUF2_POSITION                equ 0002h
SSP2BUF_SSP2BUF2_SIZE                    equ 0001h
SSP2BUF_SSP2BUF2_LENGTH                  equ 0001h
SSP2BUF_SSP2BUF2_MASK                    equ 0004h
SSP2BUF_SSP2BUF3_POSN                    equ 0003h
SSP2BUF_SSP2BUF3_POSITION                equ 0003h
SSP2BUF_SSP2BUF3_SIZE                    equ 0001h
SSP2BUF_SSP2BUF3_LENGTH                  equ 0001h
SSP2BUF_SSP2BUF3_MASK                    equ 0008h
SSP2BUF_SSP2BUF4_POSN                    equ 0004h
SSP2BUF_SSP2BUF4_POSITION                equ 0004h
SSP2BUF_SSP2BUF4_SIZE                    equ 0001h
SSP2BUF_SSP2BUF4_LENGTH                  equ 0001h
SSP2BUF_SSP2BUF4_MASK                    equ 0010h
SSP2BUF_SSP2BUF5_POSN                    equ 0005h
SSP2BUF_SSP2BUF5_POSITION                equ 0005h
SSP2BUF_SSP2BUF5_SIZE                    equ 0001h
SSP2BUF_SSP2BUF5_LENGTH                  equ 0001h
SSP2BUF_SSP2BUF5_MASK                    equ 0020h
SSP2BUF_SSP2BUF6_POSN                    equ 0006h
SSP2BUF_SSP2BUF6_POSITION                equ 0006h
SSP2BUF_SSP2BUF6_SIZE                    equ 0001h
SSP2BUF_SSP2BUF6_LENGTH                  equ 0001h
SSP2BUF_SSP2BUF6_MASK                    equ 0040h
SSP2BUF_SSP2BUF7_POSN                    equ 0007h
SSP2BUF_SSP2BUF7_POSITION                equ 0007h
SSP2BUF_SSP2BUF7_SIZE                    equ 0001h
SSP2BUF_SSP2BUF7_LENGTH                  equ 0001h
SSP2BUF_SSP2BUF7_MASK                    equ 0080h
SSP2BUF_BUF_POSN                         equ 0000h
SSP2BUF_BUF_POSITION                     equ 0000h
SSP2BUF_BUF_SIZE                         equ 0008h
SSP2BUF_BUF_LENGTH                       equ 0008h
SSP2BUF_BUF_MASK                         equ 00FFh
SSP2BUF_BUF0_POSN                        equ 0000h
SSP2BUF_BUF0_POSITION                    equ 0000h
SSP2BUF_BUF0_SIZE                        equ 0001h
SSP2BUF_BUF0_LENGTH                      equ 0001h
SSP2BUF_BUF0_MASK                        equ 0001h
SSP2BUF_BUF1_POSN                        equ 0001h
SSP2BUF_BUF1_POSITION                    equ 0001h
SSP2BUF_BUF1_SIZE                        equ 0001h
SSP2BUF_BUF1_LENGTH                      equ 0001h
SSP2BUF_BUF1_MASK                        equ 0002h
SSP2BUF_BUF2_POSN                        equ 0002h
SSP2BUF_BUF2_POSITION                    equ 0002h
SSP2BUF_BUF2_SIZE                        equ 0001h
SSP2BUF_BUF2_LENGTH                      equ 0001h
SSP2BUF_BUF2_MASK                        equ 0004h
SSP2BUF_BUF3_POSN                        equ 0003h
SSP2BUF_BUF3_POSITION                    equ 0003h
SSP2BUF_BUF3_SIZE                        equ 0001h
SSP2BUF_BUF3_LENGTH                      equ 0001h
SSP2BUF_BUF3_MASK                        equ 0008h
SSP2BUF_BUF4_POSN                        equ 0004h
SSP2BUF_BUF4_POSITION                    equ 0004h
SSP2BUF_BUF4_SIZE                        equ 0001h
SSP2BUF_BUF4_LENGTH                      equ 0001h
SSP2BUF_BUF4_MASK                        equ 0010h
SSP2BUF_BUF5_POSN                        equ 0005h
SSP2BUF_BUF5_POSITION                    equ 0005h
SSP2BUF_BUF5_SIZE                        equ 0001h
SSP2BUF_BUF5_LENGTH                      equ 0001h
SSP2BUF_BUF5_MASK                        equ 0020h
SSP2BUF_BUF6_POSN                        equ 0006h
SSP2BUF_BUF6_POSITION                    equ 0006h
SSP2BUF_BUF6_SIZE                        equ 0001h
SSP2BUF_BUF6_LENGTH                      equ 0001h
SSP2BUF_BUF6_MASK                        equ 0040h
SSP2BUF_BUF7_POSN                        equ 0007h
SSP2BUF_BUF7_POSITION                    equ 0007h
SSP2BUF_BUF7_SIZE                        equ 0001h
SSP2BUF_BUF7_LENGTH                      equ 0001h
SSP2BUF_BUF7_MASK                        equ 0080h
SSP2BUF_SSP2BUF_POSN                     equ 0000h
SSP2BUF_SSP2BUF_POSITION                 equ 0000h
SSP2BUF_SSP2BUF_SIZE                     equ 0008h
SSP2BUF_SSP2BUF_LENGTH                   equ 0008h
SSP2BUF_SSP2BUF_MASK                     equ 00FFh

// Register: SSP2ADD
#define SSP2ADD SSP2ADD
SSP2ADD                                  equ 021Ah
// bitfield definitions
SSP2ADD_SSP2ADD0_POSN                    equ 0000h
SSP2ADD_SSP2ADD0_POSITION                equ 0000h
SSP2ADD_SSP2ADD0_SIZE                    equ 0001h
SSP2ADD_SSP2ADD0_LENGTH                  equ 0001h
SSP2ADD_SSP2ADD0_MASK                    equ 0001h
SSP2ADD_SSP2ADD1_POSN                    equ 0001h
SSP2ADD_SSP2ADD1_POSITION                equ 0001h
SSP2ADD_SSP2ADD1_SIZE                    equ 0001h
SSP2ADD_SSP2ADD1_LENGTH                  equ 0001h
SSP2ADD_SSP2ADD1_MASK                    equ 0002h
SSP2ADD_SSP2ADD2_POSN                    equ 0002h
SSP2ADD_SSP2ADD2_POSITION                equ 0002h
SSP2ADD_SSP2ADD2_SIZE                    equ 0001h
SSP2ADD_SSP2ADD2_LENGTH                  equ 0001h
SSP2ADD_SSP2ADD2_MASK                    equ 0004h
SSP2ADD_SSP2ADD3_POSN                    equ 0003h
SSP2ADD_SSP2ADD3_POSITION                equ 0003h
SSP2ADD_SSP2ADD3_SIZE                    equ 0001h
SSP2ADD_SSP2ADD3_LENGTH                  equ 0001h
SSP2ADD_SSP2ADD3_MASK                    equ 0008h
SSP2ADD_SSP2ADD4_POSN                    equ 0004h
SSP2ADD_SSP2ADD4_POSITION                equ 0004h
SSP2ADD_SSP2ADD4_SIZE                    equ 0001h
SSP2ADD_SSP2ADD4_LENGTH                  equ 0001h
SSP2ADD_SSP2ADD4_MASK                    equ 0010h
SSP2ADD_SSP2ADD5_POSN                    equ 0005h
SSP2ADD_SSP2ADD5_POSITION                equ 0005h
SSP2ADD_SSP2ADD5_SIZE                    equ 0001h
SSP2ADD_SSP2ADD5_LENGTH                  equ 0001h
SSP2ADD_SSP2ADD5_MASK                    equ 0020h
SSP2ADD_SSP2ADD6_POSN                    equ 0006h
SSP2ADD_SSP2ADD6_POSITION                equ 0006h
SSP2ADD_SSP2ADD6_SIZE                    equ 0001h
SSP2ADD_SSP2ADD6_LENGTH                  equ 0001h
SSP2ADD_SSP2ADD6_MASK                    equ 0040h
SSP2ADD_SSP2ADD7_POSN                    equ 0007h
SSP2ADD_SSP2ADD7_POSITION                equ 0007h
SSP2ADD_SSP2ADD7_SIZE                    equ 0001h
SSP2ADD_SSP2ADD7_LENGTH                  equ 0001h
SSP2ADD_SSP2ADD7_MASK                    equ 0080h
SSP2ADD_ADD_POSN                         equ 0000h
SSP2ADD_ADD_POSITION                     equ 0000h
SSP2ADD_ADD_SIZE                         equ 0008h
SSP2ADD_ADD_LENGTH                       equ 0008h
SSP2ADD_ADD_MASK                         equ 00FFh
SSP2ADD_ADD0_POSN                        equ 0000h
SSP2ADD_ADD0_POSITION                    equ 0000h
SSP2ADD_ADD0_SIZE                        equ 0001h
SSP2ADD_ADD0_LENGTH                      equ 0001h
SSP2ADD_ADD0_MASK                        equ 0001h
SSP2ADD_ADD1_POSN                        equ 0001h
SSP2ADD_ADD1_POSITION                    equ 0001h
SSP2ADD_ADD1_SIZE                        equ 0001h
SSP2ADD_ADD1_LENGTH                      equ 0001h
SSP2ADD_ADD1_MASK                        equ 0002h
SSP2ADD_ADD2_POSN                        equ 0002h
SSP2ADD_ADD2_POSITION                    equ 0002h
SSP2ADD_ADD2_SIZE                        equ 0001h
SSP2ADD_ADD2_LENGTH                      equ 0001h
SSP2ADD_ADD2_MASK                        equ 0004h
SSP2ADD_ADD3_POSN                        equ 0003h
SSP2ADD_ADD3_POSITION                    equ 0003h
SSP2ADD_ADD3_SIZE                        equ 0001h
SSP2ADD_ADD3_LENGTH                      equ 0001h
SSP2ADD_ADD3_MASK                        equ 0008h
SSP2ADD_ADD4_POSN                        equ 0004h
SSP2ADD_ADD4_POSITION                    equ 0004h
SSP2ADD_ADD4_SIZE                        equ 0001h
SSP2ADD_ADD4_LENGTH                      equ 0001h
SSP2ADD_ADD4_MASK                        equ 0010h
SSP2ADD_ADD5_POSN                        equ 0005h
SSP2ADD_ADD5_POSITION                    equ 0005h
SSP2ADD_ADD5_SIZE                        equ 0001h
SSP2ADD_ADD5_LENGTH                      equ 0001h
SSP2ADD_ADD5_MASK                        equ 0020h
SSP2ADD_ADD6_POSN                        equ 0006h
SSP2ADD_ADD6_POSITION                    equ 0006h
SSP2ADD_ADD6_SIZE                        equ 0001h
SSP2ADD_ADD6_LENGTH                      equ 0001h
SSP2ADD_ADD6_MASK                        equ 0040h
SSP2ADD_ADD7_POSN                        equ 0007h
SSP2ADD_ADD7_POSITION                    equ 0007h
SSP2ADD_ADD7_SIZE                        equ 0001h
SSP2ADD_ADD7_LENGTH                      equ 0001h
SSP2ADD_ADD7_MASK                        equ 0080h
SSP2ADD_SSP2ADD_POSN                     equ 0000h
SSP2ADD_SSP2ADD_POSITION                 equ 0000h
SSP2ADD_SSP2ADD_SIZE                     equ 0008h
SSP2ADD_SSP2ADD_LENGTH                   equ 0008h
SSP2ADD_SSP2ADD_MASK                     equ 00FFh

